[
  {
    "path": "posts/2021-06-20-datavizmakeover2/",
    "title": "Dataviz_makeover_2",
    "description": "Dataviz_makeover_2",
    "author": [
      {
        "name": "Luo haoyu",
        "url": "https://github.com/luohy3"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n1 Critique of Visualization\r\nThe original visualization can be seen below.\r\n\r\n1.1 Clarity\r\nX and Y axis are messy and wrong:\r\nThey are imports and exports value which is numeric data, but they don't have tick marks or grid lines to indicate clear view of the actual imports and exports amount for different country. The 0 point should be at the beginning of x and y axis but in the graph is not.\r\nTitle is not concise:\r\nThe title is ‘MERCHANDISE TRADE PERFORMANCE WITH MAJOR TRADING PARTNERS, 2020’, it is very general and do not have sub-title to show further investigations from this graph.\r\nThe way it presents the net importers and exporters is not clear:\r\nIt uses the center point for each country to show whether they belong to importer or exporter. But for countries that have similar import value and export value they lay around the diagonal. So should have a clear way to indicate this.\r\nDo not have data source and pictures to show further elucidation.\r\n1.2 Aesthetic\r\nPresentation of each data point is ugly:\r\nBecause the shape of each data point is too big and overlapping. It looks very messy. IT should be smaller and the round should be transparent to get rid of these problems.\r\nHorrible color choice for import and export:\r\nShould not use green and blue for two reverse concepts (Net importer and Net exporter).\r\nNot interactive:\r\nDo not have further information or other graph when click on each country.\r\n2 Alternative Design\r\nThe proposed design is as follows.\r\n\r\n2.1 Clarity\r\nShow the data clearly by tooltips:\r\nUse Tooltips to clearly show import and export value and their percentile. Also create a pie chart for each country to show this.\r\nUse good title to indicate the investigations:\r\nUse title and sub-title to show the trend of this graph concisely. Also show the data source.\r\nUse pie chart to clearly show the percentage import and export takes.\r\n2.2 Aesthetic\r\nPresentation is more beautiful:\r\nEach data point has smaller shape and is transparent so have a clear view.\r\nUse appropriate colors:\r\nUse distinctive color for net importer and net exporter. And show different colors for total trade values while import&gt;export and import&lt;export. Makes it very easy to classify the type for each country\r\nData source and image source is included:\r\nBy using image can emphasize the information we want to convey in this graph and makes it clear and easy to read this graph.\r\n3 Step-by-step Guide\r\n1 Import the data into Tableau Prep Builder. Click on Cleaned with data interpreter and drag the T1 and T2 into the panel. Rename them with Import and Export. \r\n2 Add clean node for Import, custom split Variables column with ‘(’ and rename it with ‘Country’. Remove the previous column. Do the same with Export. \r\n3 Create Pivot1 after clean 1, select all months under ‘Fields’ to the ‘Pivoted Fields’ panel. Repeat for ‘Pivot 2’. \r\n4 Rename ‘Pivot 1 names’ to ‘Month’ and change data type to date. Rename ‘Pivot 1 values’ to ‘Import’. Repeat for Exports. The name for ‘pivot 2 values’ is Export. \r\n5 Do a join for Pivot 1 and 2 by Country=Country and Month=Month. \r\n6 Create a new clean node and remove the duplicate month and country. \r\n7 Add a new pivot after clean 3 and change imports and exports from columns to rows. Rename ‘Pivot values’ to ‘Trade Value (Thousand $)’ and ‘Pivot type’ to ‘Trade Type’. \r\n8 Create an output node and run the flow. Name the file ‘Monthly trade values.hyper’. \r\n9 Open it in Tableau and use sheet 1 to create the first graph. Because the trade value is in thousand dollars we create a new column by multiply 1000 and name it ‘Trade value’. \r\n10 Add month and country to filter to get the 10 countries and year 2020. \r\n11 Create a new calculated field called ‘Import’ and create ‘Export’ with same code but type=Export. \r\n12 Create 2 new calculated field ‘Total Value (Importer)’ and ‘Total Value (Exporter)’. \r\n13 Create a new calculated field called ‘Reference line’. \r\n14 Drag export and import to column and row. And drag country to detail. \r\n15 Drag country to color and trade value to size. Change the Opacity to 75%. \r\n16 Drag the reference line to rows and change to dual Axis. \r\n17 Remove the color, shape of reference line. \r\n18 Right click on the reference line data point and click show trend lines. Adjust the size of reference line to 0 and trend line to appropriate looking. Now it only shows the trend line, which is our diagonal line. Hide the reference line axis. \r\n19 Create a new sheet, drag trade type to column and trade value to row. Change it to pie chart. \r\n20 Drag country to rows. Drag trade type and trade value to labels. Click on the filter to apply filter for all sheets. Change label trade value type to percentage of total and adjust the format to one digit. Drag country to column then will show percentage for each country. \r\n21 Back to sheet 1, drag the total value(importer) and total value(exporter) to tooltip. Edit the tooltip this way. \r\n22 Add country and total value(importer) and total value(exporter) to label and edit this way. \r\n23 Change the format of all value to $_B \r\n24 Add 2 annotations ‘Net importer’ and ‘Net exporter’ at the top left and bottom right. \r\n25 Edit the tile and sub title \r\n26 Add image and adjust the annotations and axis to get best presentation. \r\n4 Derived Insights\r\nTaiwan is the extreme importer in 2020. Its import value takes 66.6% of total which means Taiwan is heavily relying on importing. At the same time, Hong Kong is the extreme exporter with 92.4% of total trade value is export. This shows Hong Kong is a very extreme area that seldom import but largely export goods.\r\nChina is biggest trading region with $136.2B total trade amount in 2020. And the export and import value is balanced for China. Malaysia has the second biggest trade value of $103.5B in 2020 and United States is the third with $102.4B in 2020.\r\nOut of these 9 areas, 6 are net exporter while 3 are net importer. For the 3 net importers (Taiwan, Japan, Malaysia), Taiwan and Japan are island area which may lead to its lack of goods.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T22:00:28+08:00",
    "input_file": "datavizmakeover2.knit.md"
  },
  {
    "path": "posts/2021-05-30-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This is a graph for merchandise trade of 6 regions, 2019-2021",
    "author": [
      {
        "name": "Luo haoyu",
        "url": "https://github.com/luohy3"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1 Critique of Visualisation\r\nThe original visualisation can be seen below.\r\n\r\n1.1 Clarity\r\nArea chart makes it difficult to gage height. Two areas overlap and looks messy. Also, area chart doesn't show the data is a time-series data.\r\nTitle (2019-2020) and content (2019-2021) are not consistent.\r\nInconsistent Y-axis for different countries makes it hard to compare. For e.g. Some use 0-6M, some use 0-8M, some use 0-2M.\r\nSecondary axis makes it hard to compare import and export data.\r\nX-axis should use title ‘Year of period’ as it only shows Year.\r\nData source not included.\r\nAnnotations are not used meaning this is no further elucidation for the graph.\r\n1.2 Aesthetic\r\nFormat of axes: vertical title of Y-axis\r\nHorrible color choice for import and export, not distinctive.\r\nUgly font size: Title is smaller than the country name.\r\nGird lines already out the graph.\r\nNo any picture included.\r\n2 Alternative Design\r\nThe proposed design is as follows.\r\n\r\n2.1 Clarity\r\nUse line chart to show the time-series data, which shows the trend clearly.\r\nDifferent regions use the same Y axis and they are in the same row, makes it easy and clear to compare. Also imports and exports use the same axis, makes it easy to compare these 2 categories.\r\nHave title and sub-title to emphasize the key observations.\r\nHave trend line to show the important date and use annotations to show details.\r\n2.2 Aesthetic\r\nCall-outs with images aid cognition.\r\nTick marks are used for years.\r\nData source and image source is included.\r\n3 Proposed Visualisation\r\nPlease view the interactive visualisation on Tableau Public here.\r\n4 Step-by-step Guide\r\n1 Import the data into Tableau. \r\n2 Use prep cleaning \r\n3 Use Tableau to pivot the data in sheet. Do the same with T2.\r\n4 Change the relationship for T1 and T2 like this. \r\n5 Change the data type and name for T1 and T2 in the worksheet. \r\n6 Use filter to get the country and date we want. \r\n7 Drag the columns and rows from data. \r\n8 Choose line graph. \r\n9 Change date(year) to date(month) \r\n10 Add title, sub-title, sources \r\n11 Change Y axis, use the same range for imports and exports, then hide one of the Y axis. \r\n12 Remove the title for X axis and Y axis. \r\n13 Change format to get the tick marks for both axes. \r\n14 Add grid lines for row. \r\n15 Hide field labels ‘country’. \r\n16 Change the region names. Remove ‘Thousand dollars’. \r\n17 Add a reference line. \r\n18 Change the reference line looking and add marks. \r\n19 Create a dashboard and drag the graph into it. \r\n20 Set the labels floating. \r\n21 Insert an image object and adjust its size. \r\n22 Adjust the graph size for better looking and now it looks like this. \r\n5 Derived Insights\r\nIn 2020 Mar, when COVID-19 outbroke, all 6 regions get influenced and their imports and exports amount both declined. After a quarter, merchandise trade for these 6 regions begin to recover.\r\nHong Kong's exports rise sharply after May 2020, in Mar 2021, it has reached 7.4M thousand dollars.\r\nTaiwan's imports rise sharply after for the whole period, it is only slightly influenced by COVID-19. In Mar 2021 it has reached 5.4M thousand dollars.\r\nHong Kong's exports is much higher than imports. While Taiwan's imports is much higher than exports.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T21:07:50+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to R for Data Science and Analyst",
    "description": "This blog consists of a collection of R tutorials, notebooks tops and tricks. We hope you enjoy reading what we have to say!",
    "author": [
      {
        "name": "Luo haoyu",
        "url": "https://github.com/luohy3"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T10:19:26+08:00",
    "input_file": "welcome.knit.md"
  }
]
